#include <bits/stdc++.h>

using namespace std;

#define X first
#define Y second

int n,m;
int arr[505][505];

pair<int, int> tetro[19][4] = {
    // 청록색 블록
    {{0,0}, {0,1}, {0,2}, {0,3}},
    {{0, 0}, {1, 0}, {2, 0}, {3, 0}},
    
    // 노랑색 
    {{0, 0}, {1, 0}, {0, 1}, {1, 1}},
    
    // 주황색 블록
    {{0, 0}, {0, 1}, {0, 2}, {1, 2}},
    {{0, 0}, {0, 1}, {0, 2}, {1, 0}},
    {{1, 0}, {1, 1}, {1, 2}, {0, 2}},
    {{1, 0}, {1, 1}, {1, 2}, {0, 0}},

    {{0, 1}, {1, 1}, {2, 1}, {0, 0}},
    {{0, 1}, {1, 1}, {2, 1}, {2, 0}},
    {{0, 0}, {1, 0}, {2, 0}, {0, 1}},
    {{0, 0}, {1, 0}, {2, 0}, {2, 1}},
    
    // 초록색 
    {{0, 0}, {0, 1}, {1, 1}, {1, 2}},
    {{1, 0}, {1, 1}, {0, 1}, {0, 2}},
    {{0, 0}, {1, 0}, {1, 1}, {2, 1}},
    {{0, 1}, {1, 1}, {1, 0}, {2, 0}},
    
    // 자주색
    {{0, 0}, {0, 1}, {0, 2}, {1, 1}},
    {{1, 0}, {1, 1}, {1, 2}, {0, 1}},
    {{0, 0}, {1, 0}, {2, 0}, {1, 1}},
    {{0, 1}, {1, 1}, {2, 1}, {1, 0}}};


int brute(int x, int y) {
    int mx = 0;
    for(int i=0; i<19; i++) {
        int sum = 0;
        for(int j=0; j<4; j++)
            sum += arr[x+tetro[i][j].X][y + tetro[i][j].Y];
        mx = max(mx, sum);
    }
    return mx;
}

int main() {
    ios::sync_with_stdio(0);
    cin.tie(0);
    
    cin >> n >> m;
    
    for(int i=0; i<n; i++) {
        for(int j=0; j<m; j++) {
            cin >> arr[i][j];
        }
    }
    
    int ans = 0;
    for(int i=0; i<n; i++){
        for(int j=0; j<m; j++)
            ans = max(ans, brute(i,j));
    }
    cout << ans;
    
}